{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point.",
  "feature_evidence.json": "Feature evidence report documenting the animated 'About Us' card section added to HomePage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing premium healthcare website pages with glassmorphism, animations, and responsive design.",
  "frontend/index.css": "Tailwind base styles with OKLCH color system defining CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point for the Oishi Heal Touch Premium Healthcare Website with root div and module script.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (home, doctors, about, lab tests, why us, testimonials, contact, blog) with shared Layout.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky glassmorphism header, gradient logo, rounded pill navigation, mobile menu sheet, and footer with brand attribution.",
  "frontend/src/hooks/useActor.ts": "React hook managing authenticated/anonymous backend actor creation using Internet Identity and React Query with automatic invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook providing Internet Identity authentication with login, logout, and identity state management using AuthClient.",
  "frontend/src/index.css": "Extended Tailwind styles with OKLCH color system, premium glassmorphism utilities, pill button styles, card hover effects, scroll reveal animations, and floating shapes.",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying clinic introduction, story, mission, vision, and values with scroll-reveal animations using IntersectionObserver. Features gradient hero section and premium card components with icons for mission/vision sections.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page with search functionality and category filters displaying health-related articles (skin care, women's health, child care, ENT, preventive health, diagnostics). Implements scroll-reveal animations and shows blog post cards with title, category badge, date, and excerpt.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form that submits to WhatsApp (phone number 919875539688) including name, phone, and message fields. Displays contact information cards with phone, location, and hours alongside the contact form.",
  "frontend/src/pages/DoctorsPage.tsx": "Doctors listing page displaying 12 specialists across dermatology, orthopedic, ENT, general physician, pediatrics, and gynecology with their schedules and fees (₹500-₹700). Features scroll-reveal animations and color-coded specialty badges.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section, clinic/lab services lists, highlights with icons, and testimonials. Features floating animated shapes, scroll-reveal effects, and showcases 10 clinic services including dermatology, orthopedic, physiotherapy, and Pathkind lab diagnostics.",
  "frontend/src/pages/LabTestsPage.tsx": "Lab tests and diagnostics page featuring Pathkind Lab partnership, test categories (full body checkup, diabetes, cardiac, thyroid, women's health, preventive packages), and scroll-reveal animations using IntersectionObserver.",
  "frontend/src/pages/TestimonialsPage.tsx": "Testimonials page displaying 15 patient reviews with star ratings, using scroll-reveal animations via IntersectionObserver to animate cards on scroll.",
  "frontend/src/pages/WhyUsPage.tsx": "Why Choose Us page highlighting 7 key reasons (Pathkind partnership, verified doctors, specialist coverage, advanced therapies, affordable pricing, easy booking, clean facility) with icon cards and scroll animations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom border radii, premium shadow utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file indicating a pending feature request (AR-1) to add an animated 'About Us' card section on the home page between the header and services sections."
}