{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point.",
  "feature_evidence.json": "Feature evidence report documenting premium visual styling, typography upgrades, hero section enhancements, and other UI improvements with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing premium UI components, pages with glassmorphism effects, animations, and mobile enhancements.",
  "frontend/index.css": "Tailwind base styles with CSS custom properties defining OKLCH color system for light and dark themes.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Oishi Heal Touch healthcare website.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for all pages (home, doctors, about, lab tests, why us, testimonials, contact, blog) wrapped in Layout component.",
  "frontend/src/components/Layout.tsx": "Shared layout component with glassmorphism header, gradient logo, rounded pill navigation, mobile sheet menu, sticky CTA button, and footer with dynamic year.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, handling anonymous and authenticated states with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication providing login, logout, identity state management, and AuthClient configuration with delegation handling.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark themes using OKLCH color space, plus utility classes for glassmorphism effects, premium buttons, and card animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "About page component for Oishi Heal Touch healthcare facility that displays introduction, story, mission, and vision sections with scroll-reveal animations using IntersectionObserver.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page with search functionality and category filters, displaying healthcare-related blog posts with titles, excerpts, dates, and categories using scroll-reveal animations.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form that submits to WhatsApp and displays clinic contact information including phone, address, and operating hours in card layouts.",
  "frontend/src/pages/DoctorsPage.tsx": "Doctors listing page displaying a grid of doctor cards with name, specialty, schedule, and fees information, featuring specialty-based color-coded badges and scroll-reveal animations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component displaying hero section, clinic/lab services, highlights, testimonials, and call-to-action sections with scroll animations and intersection observers.",
  "frontend/src/pages/LabTestsPage.tsx": "Lab tests and diagnostics page showcasing Pathkind Lab partnership, test categories (full body checkup, diabetes, cardiac, thyroid, women's health), and booking options with scroll reveal animations.",
  "frontend/src/pages/TestimonialsPage.tsx": "Testimonials page displaying 15 patient reviews with 5-star ratings for various doctors and services, using card components and scroll-triggered animations.",
  "frontend/src/pages/WhyUsPage.tsx": "Why Choose Us page highlighting seven key differentiators including Pathkind partnership, experienced doctors, specialist coverage, advanced therapies, affordable pricing, easy booking, and hygiene standards.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, custom shadows (soft, premium, glow), border radius scales, and animation utilities.",
  "project_state.json": "Project state file for Oishi Heal Touch healthcare clinic website redesign in Kolkata. Defines premium visual UI/UX enhancement requirements including glassmorphism, gradient overlays, typography upgrades, hero section enhancements, service card improvements, and mobile-first responsive design while maintaining existing layout and brand colors."
}