{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point with no implemented functionality.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing detailed summaries of all frontend source files, describing the premium healthcare website's component structure, styling, and page layouts.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including primary, secondary, accent, and semantic colors.",
  "frontend/index.html": "HTML entry point for the Oishi Heal Touch Premium Healthcare Website with root div and module script reference.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes (home, doctors, about, lab tests, why us, testimonials, contact, blog) with Layout wrapper.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky header navigation featuring logo image, desktop/mobile menus, call-to-action button, and footer with social links.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP backend actor creation with authentication support, handling both anonymous and authenticated identities with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Main stylesheet with Tailwind layers, OKLCH color variables for light/dark themes, premium glassmorphism effects, pill button styles, card animations, scroll reveals, and mobile-optimized touch targets.",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying clinic introduction, story, mission, vision, values, and awards with scroll-reveal animations and gradient hero section.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page with search functionality, category filters, and multiple health-related blog post cards covering topics like skin care, women's health, child care, and diagnostics.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form that submits to WhatsApp, displaying contact information (phone, address, hours) and an embedded Google Maps iframe.",
  "frontend/src/pages/DoctorsPage.tsx": "Doctors listing page displaying 12 specialists with their names, specialties, schedules, fees, and color-coded badges, with scroll-reveal animations and appointment booking buttons.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section, premium services (consultations, physiotherapy, lab diagnostics, imaging), highlights, testimonials, and call-to-action sections with scroll animations.",
  "frontend/src/pages/LabTestsPage.tsx": "Lab tests and diagnostics page featuring Pathkind Lab partnership, test categories (Full Body Checkup, Diabetes, Cardiac, Thyroid, Women's Health, Preventive), with scroll reveal animations and call-to-action buttons.",
  "frontend/src/pages/TestimonialsPage.tsx": "Testimonials page displaying 15 patient reviews with 5-star ratings, featuring doctors and services, using scroll reveal animations via IntersectionObserver.",
  "frontend/src/pages/WhyUsPage.tsx": "Why Choose Us page highlighting 7 key differentiators (Pathkind partnership, verified doctors, specialist coverage, advanced therapies, affordable pricing, easy booking, clean facility) with icon-based cards and scroll animations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended shadows (including premium/glow variants), custom border radii, Inter font family, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document indicating a healthcare website with custom header logo implementation (WebP format, responsive sizing 45-70px, links to homepage) and pending feature request AR-1."
}