{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: medical-themed header animations and their integration with sticky header/glassmorphism effects, both with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure with TanStack Router, premium UI components, medical-themed animations, and responsive design patterns.",
  "frontend/index.css": "Basic Tailwind CSS setup with OKLCH color system variables for light/dark themes, defining design tokens for background, foreground, primary, secondary, and other UI colors.",
  "frontend/index.html": "HTML entry point for the Oishi Heal Touch Premium Healthcare Website with root div and module script reference.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, doctors, about, lab tests, why us, testimonials, contact, and blog pages, all wrapped in Layout component.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky header featuring logo, navigation, mobile menu, medical-themed background animations (pulse circles, flowing lines, heartbeat wave), and footer.",
  "frontend/src/hooks/useActor.ts": "React hook managing backend actor creation with Internet Identity authentication, handling anonymous and authenticated actors with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with idle handling options.",
  "frontend/src/index.css": "Comprehensive Tailwind CSS configuration with OKLCH color system, premium glassmorphism effects, pill button styles, card hover animations, scroll reveal animations, and medical-themed header animations with accessibility support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying clinic introduction, story, mission, vision, and values with scroll-reveal animations using IntersectionObserver.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page with search functionality, category filters, and healthcare-related blog posts with scroll-reveal animations.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form that submits to WhatsApp and displays clinic contact information including phone, location, and hours.",
  "frontend/src/pages/DoctorsPage.tsx": "Doctors listing page displaying 12 specialists with their specialties, schedules, fees, and color-coded badges with scroll animations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section, premium services (consultations, physiotherapy, lab diagnostics, imaging), highlights, and testimonials with scroll-reveal effects.",
  "frontend/src/pages/LabTestsPage.tsx": "Lab tests and diagnostics page featuring Pathkind Lab partnership, test categories (Full Body Checkup, Diabetes, Cardiac, etc.), scroll reveal animations, and a call-to-action button to book lab tests.",
  "frontend/src/pages/TestimonialsPage.tsx": "Testimonials page displaying 15 patient reviews with star ratings, using intersection observer for scroll reveal animations on testimonial cards.",
  "frontend/src/pages/WhyUsPage.tsx": "Why Choose Us page highlighting 7 key reasons (Pathkind partnership, verified doctors, specialist coverage, therapies, pricing, booking, hygiene) with icons and scroll reveal animations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended border radius, custom box shadows including premium/glow effects, and typography/animation plugins.",
  "project_state.json": "Project state tracking file indicating a request to add subtle medical-themed background animations to the header section that integrate with existing sticky header and glassmorphism effects."
}