{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for restructuring the homepage Services section with premium cards, centered headings, responsive layouts, and hover effects.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the premium healthcare website with glassmorphism design, service cards, routing, and enhanced UI components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, defining design tokens for colors, borders, shadows, and sidebar styling.",
  "frontend/index.html": "HTML entry point for the Oishi Heal Touch Premium Healthcare Website with root div and module script reference.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with eight routes (home, doctors, about, lab tests, why us, testimonials, contact, blog) wrapped in a shared Layout component.",
  "frontend/src/components/Layout.tsx": "Shared layout component with sticky glassmorphism header, gradient logo with Heart icon, rounded pill navigation links, mobile sheet menu, and call-to-action button with phone integration.",
  "frontend/src/hooks/useActor.ts": "React hook for managing ICP backend actor instances with authentication support, creating anonymous or authenticated actors based on Internet Identity and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark theme colors using OKLCH color space, plus utility classes for glassmorphism effects, premium buttons, and typography styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying clinic introduction, story, mission, and vision with scroll-reveal animations using IntersectionObserver and premium card styling.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page with search functionality, category filters, and a grid of health-related blog posts covering topics like skin care, women's health, child care, and preventive health with scroll animations.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form that submits data via WhatsApp link and displays clinic contact information including phone, address, and operating hours in card layouts.",
  "frontend/src/pages/DoctorsPage.tsx": "Doctors listing page displaying a grid of medical specialists with their names, specialties, schedules, and consultation fees, featuring color-coded specialty badges and scroll-reveal animations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component featuring hero section, premium services showcase (consultations, physiotherapy, lab diagnostics, imaging), highlights, testimonials, and CTAs with scroll-reveal animations and IntersectionObserver.",
  "frontend/src/pages/LabTestsPage.tsx": "Lab tests and diagnostics page displaying Pathkind Lab partnership, test categories (full body checkup, diabetes, cardiac, thyroid, women's health, preventive packages) with accordion UI and scroll animations.",
  "frontend/src/pages/TestimonialsPage.tsx": "Testimonials page displaying 15 patient reviews with 5-star ratings for various doctors and services, using card components and scroll-reveal animations via IntersectionObserver.",
  "frontend/src/pages/WhyUsPage.tsx": "Why Choose Us page highlighting seven key differentiators (Pathkind partnership, verified doctors, specialist coverage, advanced therapies, affordable pricing, easy booking, clean facility) with icon-based cards and scroll animations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom shadows (premium/glow variants), extended border radius, Inter font family, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for a dental/healthcare website redesign focusing on premium service cards with responsive layouts, hover effects, and smooth animations. Defines architectural constraints including 2-column desktop grid, single-column mobile layout, rounded corners, soft shadows, and CTA button styling."
}