{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Premium UI/UX visual redesign for Oishi Heal Touch healthcare website",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Apply premium visual styling across all pages with glassmorphism effects, gradient overlays, soft shadows, increased white space, and elegant border radius",
      "acceptanceCriteria": [
        "All page sections have increased padding and margin for breathing room",
        "Cards and containers use 12px-20px border radius",
        "Soft shadows are applied with blur values between 20-40px",
        "Gradient overlays use only existing brand colors from the OKLCH color palette",
        "Glassmorphism effects (backdrop-blur) are applied to hero sections and featured cards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS utility classes for glassmorphism effects (backdrop-blur), premium shadow styles (box-shadow with 20-40px blur), gradient overlay utilities using existing OKLCH brand colors (medical blue/teal), and increase base spacing scale for luxury white space. Define custom CSS properties for reusable premium visual effects."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with custom border radius values (12px, 16px, 20px), premium shadow definitions with soft blur (20-40px), gradient color stops using existing OKLCH palette, and spacing scale adjustments for increased white space. Add backdrop-blur utilities for glassmorphism."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Apply glassmorphism to hero section and featured service cards, add gradient overlays using brand colors, increase section padding and margins, update card border radius to 16-20px, and apply soft shadows with 30-40px blur to key elements."
        },
        {
          "path": "frontend/src/pages/DoctorsPage.tsx",
          "operation": "modify",
          "description": "Update doctor cards with increased border radius (16px), soft shadows (box-shadow with 30px blur), increased padding for white space, and subtle gradient overlays on card headers using brand colors."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Apply glassmorphism effect to hero section, increase section spacing and padding, update mission/vision cards with 16-20px border radius, add soft shadows (30-40px blur), and apply gradient overlays to key sections."
        },
        {
          "path": "frontend/src/pages/LabTestsPage.tsx",
          "operation": "modify",
          "description": "Increase spacing between sections and accordion items, apply soft shadows to category cards (30px blur), update border radius to 16px on containers, and add subtle gradient overlays to featured offers section."
        },
        {
          "path": "frontend/src/pages/TestimonialsPage.tsx",
          "operation": "modify",
          "description": "Update testimonial cards with increased border radius (16px), soft shadows (30-40px blur), more generous padding for breathing room, and subtle gradient overlays on top-rated testimonials."
        },
        {
          "path": "frontend/src/pages/WhyUsPage.tsx",
          "operation": "modify",
          "description": "Apply glassmorphism to hero section, increase spacing between feature cards, update card border radius to 16-20px, add soft shadows (30-40px blur), and apply gradient overlays to highlighted features."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update contact form and info cards with increased border radius (16px), soft shadows (30px blur), more generous padding, and glassmorphism effect on form container."
        },
        {
          "path": "frontend/src/pages/BlogPage.tsx",
          "operation": "modify",
          "description": "Apply soft shadows to blog post cards (30px blur), increase border radius to 16px, add more white space between cards, and apply subtle gradient overlays to featured posts."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Apply glassmorphism effect to header navigation with backdrop-blur, add soft shadow to header, increase padding for breathing room, and ensure footer has adequate spacing with subtle background variations."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Upgrade typography system with bold geometric sans-serif headings, improved readability, larger hero headings, softer subtext colors, and premium letter spacing",
      "acceptanceCriteria": [
        "Hero headings are at least 25% larger than current size",
        "All headings use bold weight (700 or higher) with geometric sans-serif font",
        "Body text has line-height of 1.6 or higher",
        "Subtext colors use muted variants or reduced opacity",
        "Headings have letter-spacing between 0.02em and 0.05em"
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update typography theme with Inter font stack for headings (bold 700+ weight), add larger heading sizes (increase hero from current to 25%+ larger), set default line-height to 1.6+ for body text, add letter-spacing utilities (0.02em-0.05em), and define muted text color variants with reduced opacity for subtext."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global typography styles using @layer base to set Inter as heading font with bold weight (700+), increase hero heading sizes by 25%+, set body line-height to 1.6+, apply letter-spacing (0.02-0.05em) to headings, and define muted subtext color classes with reduced opacity."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update hero heading with significantly larger font size (25%+ increase), apply bold weight (700+), add letter-spacing (0.03em), update subtext with muted color variant, and ensure line-height of 1.6+ for readability."
        },
        {
          "path": "frontend/src/pages/DoctorsPage.tsx",
          "operation": "modify",
          "description": "Update page heading with bold weight (700+), add letter-spacing (0.02-0.05em), apply muted colors to doctor specialties and descriptions, and ensure all text has line-height of 1.6+."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Update all headings with bold weight (700+) and letter-spacing (0.02-0.05em), increase hero heading size by 25%+, apply muted colors to body text and descriptions, and set line-height to 1.6+."
        },
        {
          "path": "frontend/src/pages/LabTestsPage.tsx",
          "operation": "modify",
          "description": "Apply bold weight (700+) and letter-spacing to category headings, use muted colors for test descriptions, ensure line-height of 1.6+ for readability, and increase main heading size."
        },
        {
          "path": "frontend/src/pages/TestimonialsPage.tsx",
          "operation": "modify",
          "description": "Update page heading with bold weight (700+) and letter-spacing (0.03em), apply muted colors to patient names and dates, ensure testimonial text has line-height of 1.6+, and increase main heading size."
        },
        {
          "path": "frontend/src/pages/WhyUsPage.tsx",
          "operation": "modify",
          "description": "Apply bold weight (700+) and letter-spacing to feature headings, increase hero heading size by 25%+, use muted colors for descriptions, and set line-height to 1.6+ for body text."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update headings with bold weight (700+) and letter-spacing (0.02em), apply muted colors to form labels and info text, and ensure line-height of 1.6+ throughout."
        },
        {
          "path": "frontend/src/pages/BlogPage.tsx",
          "operation": "modify",
          "description": "Apply bold weight (700+) and letter-spacing to blog post titles, use muted colors for excerpts and dates, increase main heading size, and set line-height to 1.6+ for readability."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enhance hero section on HomePage with background gradient blur, floating shapes, fade-in animation, pill-style CTA buttons with gradient backgrounds, and hover glow effects",
      "acceptanceCriteria": [
        "Hero section background has gradient with blur effect applied",
        "2-3 floating decorative shapes are positioned using CSS (absolute/fixed) with subtle animation",
        "Hero content fades in smoothly on page load (0.6-1s duration)",
        "CTA buttons use rounded pill style (border-radius 9999px or equivalent)",
        "CTA buttons have gradient background from brand color palette",
        "CTA buttons scale to 1.05 and show glow effect on hover"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add gradient blur background to hero section using existing brand colors (medical blue/teal), create 2-3 floating decorative shapes with absolute positioning and CSS animation, implement fade-in animation on hero content (0.8s duration), convert CTA buttons to pill style (border-radius: 9999px), apply gradient backgrounds using brand color palette, and add hover effects with scale(1.05) and glow (box-shadow with brand color)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add @keyframes for fade-in animation (0-1s duration with opacity transition), floating shape animations (subtle movement using translate), and define reusable CSS classes for pill buttons with gradient backgrounds and glow hover effects using brand colors."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Add animation utilities for fade-in and floating shapes to the extend section, define gradient color stops for pill buttons using existing OKLCH brand palette, and add glow shadow utilities for button hover states."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Enhance service cards across all pages with hover lift effect, shadow depth increase, animated icon hover, gradient border glow, and premium SaaS design feel",
      "acceptanceCriteria": [
        "Service cards lift up 8-12px on hover using translateY",
        "Card shadow increases in size and intensity on hover",
        "Icons within cards scale or rotate slightly on card hover",
        "Cards show gradient border glow on hover using brand colors",
        "All card transitions use 0.3s ease-in-out timing",
        "Grid layout structure remains unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add reusable CSS classes for premium card hover effects including translateY(-10px) lift, shadow depth increase on hover (from 30px to 40px blur), gradient border glow using brand colors, icon animation (scale 1.1 or rotate), and 0.3s ease-in-out transition timing for all transforms."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Apply hover lift effect (translateY -10px) to service cards, increase shadow on hover, add icon scale animation (1.1) on card hover, implement gradient border glow using brand colors, ensure 0.3s ease-in-out transition, and maintain existing grid layout structure."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Apply hover lift and shadow effects to mission/vision cards, add icon animations on hover, implement gradient border glow, use 0.3s ease-in-out transitions, and preserve grid layout."
        },
        {
          "path": "frontend/src/pages/LabTestsPage.tsx",
          "operation": "modify",
          "description": "Add hover lift effect (translateY -10px) to test category cards, increase shadow depth on hover, animate category icons with scale or rotate, add gradient border glow, and apply 0.3s ease-in-out transitions."
        },
        {
          "path": "frontend/src/pages/WhyUsPage.tsx",
          "operation": "modify",
          "description": "Apply hover effects to feature cards including lift (translateY -10px), shadow increase, icon animation (scale 1.1), gradient border glow using brand colors, and 0.3s ease-in-out transitions."
        },
        {
          "path": "frontend/src/pages/DoctorsPage.tsx",
          "operation": "modify",
          "description": "Add hover lift effect to doctor cards (translateY -10px), increase shadow on hover, ensure 0.3s ease-in-out transitions, and maintain existing grid layout structure."
        },
        {
          "path": "frontend/src/pages/TestimonialsPage.tsx",
          "operation": "modify",
          "description": "Apply hover lift (translateY -8px) to testimonial cards, increase shadow depth on hover, add gradient border glow, and use 0.3s ease-in-out transitions."
        },
        {
          "path": "frontend/src/pages/BlogPage.tsx",
          "operation": "modify",
          "description": "Add hover effects to blog post cards including lift (translateY -10px), shadow increase, gradient border glow on hover, and 0.3s ease-in-out transitions."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Redesign all primary action buttons (Book Appointment, Call Now, View Doctors) with pill style, soft shadows, gradient backgrounds, hover glow, and click animations",
      "acceptanceCriteria": [
        "All Book Appointment buttons use pill style with full rounded corners",
        "All Call Now buttons use pill style with full rounded corners",
        "All View Doctors buttons use pill style with full rounded corners",
        "Buttons have soft drop shadow applied",
        "Button backgrounds use gradient from brand color palette",
        "Buttons show glow effect on hover (box-shadow with color)",
        "Buttons scale down slightly (0.95-0.98) on active/click state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Create reusable CSS classes for premium pill buttons including border-radius 9999px, gradient backgrounds using OKLCH brand colors (medical blue/teal), soft drop shadows (20-30px blur), hover glow effect (box-shadow with brand color), and active state scale(0.97) with smooth transitions."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Convert all Book Appointment and View Doctors buttons to pill style (border-radius: 9999px), apply gradient backgrounds using brand colors, add soft shadows, implement hover glow effect, and add active scale(0.97) animation."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update fixed mobile CTA button (Call Now) to pill style with gradient background, soft shadow, hover glow effect, and active scale(0.97) animation."
        },
        {
          "path": "frontend/src/pages/DoctorsPage.tsx",
          "operation": "modify",
          "description": "Convert all Book Appointment buttons on doctor cards to pill style, apply gradient backgrounds, add soft shadows and hover glow, and implement active scale animation."
        },
        {
          "path": "frontend/src/pages/LabTestsPage.tsx",
          "operation": "modify",
          "description": "Update Call Now and booking buttons to pill style with gradient backgrounds, soft shadows, hover glow effects, and active scale(0.97) on click."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Convert contact form submit button and Call Now button to pill style with gradient backgrounds, soft shadows, hover glow, and active scale animation."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Update any CTA buttons to pill style with gradient backgrounds using brand colors, soft shadows, hover glow effects, and active scale animation."
        },
        {
          "path": "frontend/src/pages/WhyUsPage.tsx",
          "operation": "modify",
          "description": "Convert CTA buttons to pill style with gradient backgrounds, soft shadows, hover glow, and active state scale(0.97) animation."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Upgrade mobile experience with improved spacing, larger touch-friendly buttons (48px minimum), sticky bottom CTA with glassmorphism, and smooth scroll reveal animations",
      "acceptanceCriteria": [
        "Mobile spacing increased by at least 25% between sections",
        "All interactive buttons have minimum 48px height on mobile viewports",
        "Sticky bottom CTA bar is implemented with backdrop-blur glassmorphism",
        "Sticky CTA remains fixed at bottom during scroll on mobile",
        "Content sections animate in smoothly as user scrolls down"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add mobile-specific CSS with media queries (@media max-width 768px) to increase spacing by 25%+ between sections, set minimum button height to 48px, define scroll reveal animations using @keyframes (fade-in and slide-up), and create glassmorphism utility class with backdrop-blur for sticky CTA."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update fixed mobile CTA button to have glassmorphism effect (backdrop-blur with semi-transparent background), ensure it stays fixed at bottom with z-index, set minimum 48px height, and add proper padding for touch-friendly interaction on mobile viewports."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Increase mobile spacing between sections by 25%+, ensure all buttons have 48px minimum height on mobile, implement scroll reveal animations on service cards and testimonials using Intersection Observer or CSS, and add smooth fade-in/slide-up effects."
        },
        {
          "path": "frontend/src/pages/DoctorsPage.tsx",
          "operation": "modify",
          "description": "Increase mobile padding and margins by 25%, ensure appointment buttons have 48px minimum height on mobile, and add scroll reveal animations to doctor cards as they enter viewport."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Increase mobile spacing between sections by 25%+, ensure buttons are 48px minimum height, and implement scroll reveal animations on mission/vision cards."
        },
        {
          "path": "frontend/src/pages/LabTestsPage.tsx",
          "operation": "modify",
          "description": "Add 25%+ more spacing on mobile between test categories and sections, ensure all interactive buttons have 48px minimum height, and add scroll reveal animations to accordion items."
        },
        {
          "path": "frontend/src/pages/TestimonialsPage.tsx",
          "operation": "modify",
          "description": "Increase mobile spacing between testimonial cards by 25%, ensure proper touch spacing, and implement scroll reveal animations as testimonials enter viewport."
        },
        {
          "path": "frontend/src/pages/WhyUsPage.tsx",
          "operation": "modify",
          "description": "Add 25%+ mobile spacing between feature cards, ensure buttons have 48px minimum height, and implement scroll reveal animations on features."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Increase mobile spacing in contact form and info sections by 25%, ensure form inputs and buttons are 48px minimum height, and add scroll reveal animations."
        },
        {
          "path": "frontend/src/pages/BlogPage.tsx",
          "operation": "modify",
          "description": "Add 25%+ mobile spacing between blog cards, ensure interactive elements are touch-friendly (48px minimum), and implement scroll reveal animations as posts appear."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement elegant micro-interactions throughout the site including scroll reveal animations, hover transitions, button ripple/glow effects, and subtle icon animations",
      "acceptanceCriteria": [
        "Sections fade in or slide up as they enter viewport during scroll",
        "All interactive elements (links, cards, buttons) have smooth hover transitions",
        "Buttons show ripple or expanding glow effect when clicked",
        "Icons show subtle animation on hover (scale, rotate, or bounce)",
        "All animations use CSS transitions or keyframes (no heavy libraries)",
        "Animation durations are between 0.2s and 0.6s for subtlety"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add @keyframes for scroll reveal animations (fade-in, slide-up with 0.4-0.6s duration), icon hover animations (scale 1.1, rotate 5deg, or bounce with 0.2-0.3s timing), button ripple/glow effect using box-shadow expansion, and global hover transition classes (0.3s ease-in-out) for all interactive elements."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend animation configuration with custom keyframes for scroll reveals, icon animations, and ripple effects. Add timing utilities for 0.2s-0.6s durations, and define smooth ease-in-out transition functions."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Implement scroll reveal animations on service sections and testimonials using CSS animation classes with Intersection Observer logic or scroll-triggered animation, add hover transitions to all links and cards (0.3s), apply button ripple/glow effect on click, and add icon hover animations (scale or rotate 0.2s)."
        },
        {
          "path": "frontend/src/pages/DoctorsPage.tsx",
          "operation": "modify",
          "description": "Add scroll reveal animations to doctor cards (fade-in slide-up 0.5s), implement smooth hover transitions on all interactive elements (0.3s), add button ripple/glow on click, and apply subtle icon animations on hover."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Implement scroll reveal on mission/vision cards and value sections, add hover transitions to all links and cards (0.3s ease-in-out), apply icon hover animations (scale 1.1 or rotate), and add button ripple effect on interaction."
        },
        {
          "path": "frontend/src/pages/LabTestsPage.tsx",
          "operation": "modify",
          "description": "Add scroll reveal animations to test category sections (0.4-0.5s), implement hover transitions on accordion items and cards, add icon animations on hover (scale or bounce 0.2s), and apply button glow effect on click."
        },
        {
          "path": "frontend/src/pages/TestimonialsPage.tsx",
          "operation": "modify",
          "description": "Implement scroll reveal on testimonial cards (staggered fade-in 0.4-0.6s), add hover transitions to cards (0.3s), and ensure smooth animations without heavy libraries."
        },
        {
          "path": "frontend/src/pages/WhyUsPage.tsx",
          "operation": "modify",
          "description": "Add scroll reveal animations to feature cards (slide-up 0.5s), implement icon hover animations (scale 1.15 or rotate 0.3s), add hover transitions to all interactive elements, and apply button ripple/glow on click."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Implement scroll reveal on form and info sections, add hover transitions to links and cards (0.3s), apply icon animations on hover, and add button ripple effect on form submission."
        },
        {
          "path": "frontend/src/pages/BlogPage.tsx",
          "operation": "modify",
          "description": "Add scroll reveal animations to blog post cards (fade-in 0.4s), implement hover transitions on all cards and links (0.3s ease-in-out), and ensure animations are elegant and performant using CSS only."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add smooth hover transitions to navigation links (0.2s), implement icon animations on mobile menu toggle (rotate or scale 0.3s), and add subtle hover effects to footer links with smooth transitions."
        }
      ]
    }
  ]
}